# Libraries and Dependencies in Python for Data science
### Table of Contents

<div style="background-color: #cfc ; padding: 10px; border: 1px solid green;">

   <li>Pandas</li>
   <li>Numpy</li>

#### Pandas

Pandas is a name derived from 'Panel Datas' from the field of econometrics. Pandas is a python library with set of pre-bulit or pre-defined methods (classes,functions) that can be used to analyze datas. Assuming that the pandas library is installed, we will start from seeing how to import the library into your code.

In [3]:
# pandas can be imported as follows
import pandas as pd

In the above bit we used a command import to import the pandas library. The second bit, 'as pd' states that the imported pandas library can be referred using the object pd in the rest of the program. It is interesting to see what is the type of the object pd.

In [4]:
type(pd)

module

##### Guess you know it now. So that says pandas is an in-built python module.

It is usefult to know all the pre built functions and classes that are present within the pandas module. However, we will look at some important functions only.

#### Most importantly, pandas allows users to work with large data piles like Excel or csv data. Within pandas they are called dataframes.
Let's see how we can load a data file as a data frame in pandas.

In [18]:
df = pd.read_excel('./data_files/income_data.xlsx')
df.head()

,"Table with row headers in column A and column headers in rows 8 through 9, 12 through 13, 19 through 20, 26 through 27, 36 through 37, 49 through 50, 65 through 66, 75 through 76, 85 through 86, and 99 through 100",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 41,Unnamed: 42,Unnamed: 43,Unnamed: 44,Unnamed: 45,Unnamed: 46,Unnamed: 47,Unnamed: 48,Unnamed: 49,Unnamed: 50
0,All Races,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Characteristic,Total,"Under $5,000","$5,000 to $9,999","$10,000 to $14,999","$15,000 to $19,999","$20,000 to $24,999","$25,000 to $29,999","$30,000 to $34,999","$35,000 to $39,999",...,"$195,000 to $199,999","$200,000 and over",Median income,NaN,Mean income,NaN,Gini ratio,NaN,Income per\nfamily member,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,Value\n(Dol.),Standard\nerror (Dol.),Value\n(Dol.),Standard\nerror (Dol.),Ratio,Standard\nerror,Value\n(Dol.),Standard\nerror
3,All Families,83508,1941,1212,1816,2055,2753,2915,3242,3280,...,509,9393,78646,518,106045,690,0.452,0.0024,33799,236
4,TYPE OF RESIDENCE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
# you can make your own data frame by casting a dictionary to Dataframe as follows
dictionary={'Income range':['Under $5,000', '$5,000 to  $9,999', '$10,000 to $14,999'],'Number of families':['1941','1212','1816']
}
incometable=pd.DataFrame(dictionary)
print(incometable)

         Income range Number of families
0        Under $5,000               1941
1   $5,000 to  $9,999               1212
2  $10,000 to $14,999               1816

In [14]:
type(incometable)

pandas.core.frame.DataFrame

In [15]:
income=incometable[['Number of families']]

In [16]:
print(income)

  Number of families
0               1941
1               1212
2               1816

In [24]:
families=df[['Unnamed: 1']]
print(families)

    Unnamed: 1
0          NaN
1        Total
2          NaN
3        83508
4          NaN
5        Total
6          NaN
7        72000
8        24827
9        47173
10       11508
11         NaN
12       Total
13         NaN
14       14035
15       17556
16       32518
17       19398
18         NaN
19       Total
20         NaN
21       83508
22       61971
23        6485
24       15052
25         467
26         NaN
27       Total
28         NaN
29       65067
..         ...
73        2178
74        1.54
75         NaN
76       Total
77         NaN
78       83508
79       57745
80       48903
81       43280
82        3676
83        1946
84        8842
85        5225
86        1865
87        1752
88       25763
89         NaN
90       Total
91         NaN
92       80502
93        2608
94        4497
95       20288
96       13436
97        8923
98       30750
99       18642
100       9004
101       1232
102       1872

[103 rows x 1 columns]

In [30]:
families=df.iloc[:,4]
print(families)

0                     NaN
1      $10,000 to $14,999
2                     NaN
3                    1816
4                     NaN
5      $10,000 to $14,999
6                     NaN
7                    1531
8                     733
9                     798
10                    285
11                    NaN
12     $10,000 to $14,999
13                    NaN
14                    255
15                    392
16                    809
17                    360
18                    NaN
19     $10,000 to $14,999
20                    NaN
21                   1816
22                    650
23                    256
24                    910
25                     20
26                    NaN
27     $10,000 to $14,999
28                    NaN
29                   1430
              ...
73                      0
74                   0.64
75                    NaN
76     $10,000 to $14,999
77                    NaN
78                   1816
79                    798
80                    464
81                    229
82                     89
83                    145
84                    334
85                    191
86                     57
87                     86
88                   1018
89                    NaN
90     $10,000 to $14,999
91                    NaN
92                   1723
93                    153
94                    319
95                    645
96                    274
97                    135
98                    198
99                    139
100                    43
101                     7
102                     9
Name: Unnamed: 4, Length: 103, dtype: object